<!-- add-pr-comment:prod-tfplan -->

Terraform plan output for prod

```text


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.backstage.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
      ~ desired_count                      = 1 -> 2
        id                                 = "arn:aws:ecs:us-east-1:235465132804:service/arc-prod-cluster/arc-prod-cluster-backstage"
        name                               = "arc-prod-cluster-backstage"
        tags                               = {
            "Environment" = "prod"
            "MonoRepo"    = "False"
            "Name"        = "arc-prod-cluster-backstage"
            "Project"     = "arc"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:235465132804:task-definition/arc-prod-cluster-backstage:2" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backstage.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:us-east-1:235465132804:task-definition/arc-prod-cluster-backstage:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:235465132804:task-definition/arc-prod-cluster-backstage" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  ~ image                  = "235465132804.dkr.ecr.us-east-1.amazonaws.com/sourcefuse-backstage:main" -> "235465132804.dkr.ecr.us-east-1.amazonaws.com/sourcefuse-backstage:latest"
                  - mountPoints            = []
                    name                   = "arc-prod-cluster-backstage"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  ~ secrets                = [
                        # (12 unchanged elements hidden)
                        {
                            name      = "INTEGRATION_GITHUB_WEBHOOK_SECRET"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:235465132804:secret:arc/prod/sf-arc-prod-backstage-SPbnDX:INTEGRATION_GITHUB_WEBHOOK_SECRET::"
                        },
                      + {
                          + name      = "SNYK_TOKEN"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:235465132804:secret:arc/prod/sf-arc-prod-backstage-SPbnDX:SNYK_TOKEN::"
                        },
                        {
                            name      = "INTEGRATION_GITHUB_PRIVATE_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:235465132804:secret:arc/prod/sf-arc-prod-backstage-private-key-B26BqK"
                        },
                    ]
                  - volumesFrom            = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "arc-prod-cluster-backstage" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "MonoRepo"    = "False"
            "Name"        = "arc-prod-cluster-backstage"
            "Project"     = "arc"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

